from typing import Dict

from base.skill import Skill

SKILLS: Dict[type, Dict[int, dict]] = {
    Skill: {
        # 通用
        4326: dict(channel_interval=16), 32816: {}, 19055: {},
        # 日月净世
        14701: {}, 4476: {}, 40088: {}, 40089: {},
        13359: dict(bind_dots={4202: 1}),
        # 御暗烬灭令
        4480: {}, 4482: {},
        # 奇穴
        18280: {}, 18281: {}, 26916: {}, 26708: {}, 26709: {}, 18631: dict(post_buffs={-12575: {1: 1}}),
        34985: {}, 34348: {}, 34349: {},
        34361: {}, 34359: {}, 34356: {}, 34355: {},
        37336: {},
        # 装备
        25777: {}, 35065: {},
    }
}
