from typing import Dict

from base.skill import Skill

SKILLS: Dict[type, Dict[int, dict]] = {
    Skill: {
        # 通用
        4326: dict(channel_interval=16), 32816: {}, 19055: {},
        # 日月净世
        14701: {}, 4476: {}, 40088: {}, 40089: {}, 6257: {}, 6258: {},
        13359: dict(bind_dots={4202: 1}), 4024: {}, 4025: {}, 4026: {}, 4028: {}, 4029: {}, 4030: {},
        # 大圣明尊法
        3980: {},
        # 奇穴
        18280: {}, 18281: {}, 25179: {}, 6750: {}, 40255: {}, 26708: {}, 26709: {},
        # 装备
        25777: {}, 35065: {},
    }
}
